GopalSaraf/Practicals/PSDL/include/proc/pic16lf18877.inc
#define PSCNT0                           BANKMASK(WDTPSL), 0
#define PSCNT1                           BANKMASK(WDTPSL), 1
#define PSCNT10                          BANKMASK(WDTPSH), 2
#define PSCNT11                          BANKMASK(WDTPSH), 3
#define PSCNT12                          BANKMASK(WDTPSH), 4
#define PSCNT13                          BANKMASK(WDTPSH), 5
#define PSCNT14                          BANKMASK(WDTPSH), 6
#define PSCNT15                          BANKMASK(WDTPSH), 7
#define PSCNT16                          BANKMASK(WDTTMR), 0
#define PSCNT17                          BANKMASK(WDTTMR), 1
#define PSCNT2                           BANKMASK(WDTPSL), 2
#define PSCNT3                           BANKMASK(WDTPSL), 3
#define PSCNT4                           BANKMASK(WDTPSL), 4
#define PSCNT5                           BANKMASK(WDTPSL), 5
#define PSCNT6                           BANKMASK(WDTPSL), 6
#define PSCNT7                           BANKMASK(WDTPSL), 7
#define PSCNT8                           BANKMASK(WDTPSH), 0
#define PSCNT9                           BANKMASK(WDTPSH), 1
#define PSS0                             BANKMASK(DAC1CON0), 2
#define PSS1                             BANKMASK(DAC1CON0), 3
#define PWM6DC0                          BANKMASK(PWM6DCL), 6
#define PWM6DC1                          BANKMASK(PWM6DCL), 7
#define PWM6DC2                          BANKMASK(PWM6DCH), 0
#define PWM6DC3                          BANKMASK(PWM6DCH), 1
#define PWM6DC4                          BANKMASK(PWM6DCH), 2
#define PWM6DC5                          BANKMASK(PWM6DCH), 3
#define PWM6DC6                          BANKMASK(PWM6DCH), 4
#define PWM6DC7                          BANKMASK(PWM6DCH), 5
#define PWM6DC8                          BANKMASK(PWM6DCH), 6
#define PWM6DC9                          BANKMASK(PWM6DCH), 7
#define PWM6EN                           BANKMASK(PWM6CON), 7
#define PWM6MD                           BANKMASK(PMD3), 5
#define PWM6OUT                          BANKMASK(PWM6CON), 5
#define PWM6POL                          BANKMASK(PWM6CON), 4
#define PWM7DC0                          BANKMASK(PWM7DCL), 6
#define PWM7DC1                          BANKMASK(PWM7DCL), 7
#define PWM7DC2                          BANKMASK(PWM7DCH), 0
#define PWM7DC3                          BANKMASK(PWM7DCH), 1
#define PWM7DC4                          BANKMASK(PWM7DCH), 2
#define PWM7DC5                          BANKMASK(PWM7DCH), 3
#define PWM7DC6                          BANKMASK(PWM7DCH), 4
#define PWM7DC7                          BANKMASK(PWM7DCH), 5
#define PWM7DC8                          BANKMASK(PWM7DCH), 6
#define PWM7DC9                          BANKMASK(PWM7DCH), 7
#define PWM7EN                           BANKMASK(PWM7CON), 7
#define PWM7MD                           BANKMASK(PMD3), 6
#define PWM7OUT                          BANKMASK(PWM7CON), 5
#define PWM7POL                          BANKMASK(PWM7CON), 4
#define RA0                              BANKMASK(PORTA), 0
#define RA0PPS0                          BANKMASK(RA0PPS), 0
#define RA0PPS1                          BANKMASK(RA0PPS), 1
#define RA0PPS2                          BANKMASK(RA0PPS), 2
#define RA0PPS3                          BANKMASK(RA0PPS), 3
#define RA0PPS4                          BANKMASK(RA0PPS), 4
#define RA0PPS5                          BANKMASK(RA0PPS), 5
#define RA1                              BANKMASK(PORTA), 1
#define RA1PPS0                          BANKMASK(RA1PPS), 0
#define RA1PPS1                          BANKMASK(RA1PPS), 1
#define RA1PPS2                          BANKMASK(RA1PPS), 2
#define RA1PPS3                          BANKMASK(RA1PPS), 3
#define RA1PPS4                          BANKMASK(RA1PPS), 4
#define RA1PPS5                          BANKMASK(RA1PPS), 5
#define RA2                              BANKMASK(PORTA), 2
#define RA2PPS0                          BANKMASK(RA2PPS), 0
#define RA2PPS1                          BANKMASK(RA2PPS), 1
#define RA2PPS2                          BANKMASK(RA2PPS), 2
#define RA2PPS3                          BANKMASK(RA2PPS), 3
#define RA2PPS4                          BANKMASK(RA2PPS), 4
#define RA2PPS5                          BANKMASK(RA2PPS), 5
#define RA3                              BANKMASK(PORTA), 3
#define RA3PPS0                          BANKMASK(RA3PPS), 0
#define RA3PPS1                          BANKMASK(RA3PPS), 1
#define RA3PPS2                          BANKMASK(RA3PPS), 2
#define RA3PPS3                          BANKMASK(RA3PPS), 3
#define RA3PPS4                          BANKMASK(RA3PPS), 4
#define RA3PPS5                          BANKMASK(RA3PPS), 5
#define RA4                              BANKMASK(PORTA), 4
#define RA4PPS0                          BANKMASK(RA4PPS), 0
#define RA4PPS1                          BANKMASK(RA4PPS), 1
#define RA4PPS2                          BANKMASK(RA4PPS), 2
#define RA4PPS3                          BANKMASK(RA4PPS), 3
#define RA4PPS4                          BANKMASK(RA4PPS), 4
#define RA4PPS5                          BANKMASK(RA4PPS), 5
#define RA5                              BANKMASK(PORTA), 5
#define RA5PPS0                          BANKMASK(RA5PPS), 0
#define RA5PPS1                          BANKMASK(RA5PPS), 1
#define RA5PPS2                          BANKMASK(RA5PPS), 2
#define RA5PPS3                          BANKMASK(RA5PPS), 3
#define RA5PPS4                          BANKMASK(RA5PPS), 4
#define RA5PPS5                          BANKMASK(RA5PPS), 5
#define RA6                              BANKMASK(PORTA), 6
#define RA6PPS0                          BANKMASK(RA6PPS), 0
#define RA6PPS1                          BANKMASK(RA6PPS), 1
#define RA6PPS2                          BANKMASK(RA6PPS), 2
#define RA6PPS3                          BANKMASK(RA6PPS), 3
#define RA6PPS4                          BANKMASK(RA6PPS), 4
#define RA6PPS5                          BANKMASK(RA6PPS), 5
#define RA7                              BANKMASK(PORTA), 7
#define RA7PPS0                          BANKMASK(RA7PPS), 0
#define RA7PPS1                          BANKMASK(RA7PPS), 1
#define RA7PPS2                          BANKMASK(RA7PPS), 2
#define RA7PPS3                          BANKMASK(RA7PPS), 3
#define RA7PPS4                          BANKMASK(RA7PPS), 4
#define RA7PPS5                          BANKMASK(RA7PPS), 5
#define RB0                              BANKMASK(PORTB), 0
#define RB0PPS0                          BANKMASK(RB0PPS), 0
#define RB0PPS1                          BANKMASK(RB0PPS), 1
#define RB0PPS2                          BANKMASK(RB0PPS), 2
#define RB0PPS3                          BANKMASK(RB0PPS), 3
#define RB0PPS4                          BANKMASK(RB0PPS), 4
#define RB0PPS5                          BANKMASK(RB0PPS), 5
#define RB1                              BANKMASK(PORTB), 1
#define RB1PPS0                          BANKMASK(RB1PPS), 0
#define RB1PPS1                          BANKMASK(RB1PPS), 1
#define RB1PPS2                          BANKMASK(RB1PPS), 2
#define RB1PPS3                          BANKMASK(RB1PPS), 3
#define RB1PPS4                          BANKMASK(RB1PPS), 4
#define RB1PPS5                          BANKMASK(RB1PPS), 5
#define RB2                              BANKMASK(PORTB), 2
#define RB2PPS0                          BANKMASK(RB2PPS), 0
#define RB2PPS1                          BANKMASK(RB2PPS), 1
#define RB2PPS2                          BANKMASK(RB2PPS), 2
#define RB2PPS3                          BANKMASK(RB2PPS), 3
#define RB2PPS4                          BANKMASK(RB2PPS), 4
#define RB2PPS5                          BANKMASK(RB2PPS), 5
#define RB3                              BANKMASK(PORTB), 3
#define RB3PPS0                          BANKMASK(RB3PPS), 0
#define RB3PPS1                          BANKMASK(RB3PPS), 1
#define RB3PPS2                          BANKMASK(RB3PPS), 2
#define RB3PPS3                          BANKMASK(RB3PPS), 3
#define RB3PPS4                          BANKMASK(RB3PPS), 4
#define RB3PPS5                          BANKMASK(RB3PPS), 5
#define RB4                              BANKMASK(PORTB), 4
#define RB4PPS0                          BANKMASK(RB4PPS), 0
#define RB4PPS1                          BANKMASK(RB4PPS), 1
#define RB4PPS2                          BANKMASK(RB4PPS), 2
#define RB4PPS3                          BANKMASK(RB4PPS), 3
#define RB4PPS4                          BANKMASK(RB4PPS), 4
#define RB4PPS5                          BANKMASK(RB4PPS), 5
#define RB5                              BANKMASK(PORTB), 5
#define RB5PPS0                          BANKMASK(RB5PPS), 0
#define RB5PPS1                          BANKMASK(RB5PPS), 1
#define RB5PPS2                          BANKMASK(RB5PPS), 2
#define RB5PPS3                          BANKMASK(RB5PPS), 3
#define RB5PPS4                          BANKMASK(RB5PPS), 4
#define RB5PPS5                          BANKMASK(RB5PPS), 5
#define RB6                              BANKMASK(PORTB), 6
#define RB6PPS0                          BANKMASK(RB6PPS), 0
#define RB6PPS1                          BANKMASK(RB6PPS), 1
#define RB6PPS2                          BANKMASK(RB6PPS), 2
#define RB6PPS3                          BANKMASK(RB6PPS), 3
#define RB6PPS4                          BANKMASK(RB6PPS), 4
#define RB6PPS5                          BANKMASK(RB6PPS), 5
#define RB7                              BANKMASK(PORTB), 7
#define RB7PPS0                          BANKMASK(RB7PPS), 0
#define RB7PPS1                          BANKMASK(RB7PPS), 1
#define RB7PPS2                          BANKMASK(RB7PPS), 2
#define RB7PPS3                          BANKMASK(RB7PPS), 3
#define RB7PPS4                          BANKMASK(RB7PPS), 4
#define RB7PPS5                          BANKMASK(RB7PPS), 5
#define RC0                              BANKMASK(PORTC), 0
#define RC0PPS0                          BANKMASK(RC0PPS), 0
#define RC0PPS1                          BANKMASK(RC0PPS), 1
#define RC0PPS2                          BANKMASK(RC0PPS), 2
#define RC0PPS3                          BANKMASK(RC0PPS), 3
#define RC0PPS4                          BANKMASK(RC0PPS), 4
#define RC0PPS5                          BANKMASK(RC0PPS), 5
#define RC1                              BANKMASK(PORTC), 1
#define RC1PPS0                          BANKMASK(RC1PPS), 0
#define RC1PPS1                          BANKMASK(RC1PPS), 1
#define RC1PPS2                          BANKMASK(RC1PPS), 2
#define RC1PPS3                          BANKMASK(RC1PPS), 3
#define RC1PPS4                          BANKMASK(RC1PPS), 4
#define RC1PPS5                          BANKMASK(RC1PPS), 5
#define RC2                              BANKMASK(PORTC), 2
#define RC2PPS0                          BANKMASK(RC2PPS), 0
#define RC2PPS1                          BANKMASK(RC2PPS), 1
#define RC2PPS2                          BANKMASK(RC2PPS), 2
#define RC2PPS3                          BANKMASK(RC2PPS), 3
#define RC2PPS4                          BANKMASK(RC2PPS), 4
#define RC2PPS5                          BANKMASK(RC2PPS), 5
#define RC3                              BANKMASK(PORTC), 3
#define RC3PPS0                          BANKMASK(RC3PPS), 0
#define RC3PPS1                          BANKMASK(RC3PPS), 1
#define RC3PPS2                          BANKMASK(RC3PPS), 2
#define RC3PPS3                          BANKMASK(RC3PPS), 3
#define RC3PPS4                          BANKMASK(RC3PPS), 4
#define RC3PPS5                          BANKMASK(RC3PPS), 5
#define RC4                              BANKMASK(PORTC), 4
#define RC4PPS0                          BANKMASK(RC4PPS), 0
#define RC4PPS1                          BANKMASK(RC4PPS), 1
#define RC4PPS2                          BANKMASK(RC4PPS), 2
#define RC4PPS3                          BANKMASK(RC4PPS), 3
#define RC4PPS4                          BANKMASK(RC4PPS), 4
#define RC4PPS5                          BANKMASK(RC4PPS), 5
#define RC5                              BANKMASK(PORTC), 5
#define RC5PPS0                          BANKMASK(RC5PPS), 0
#define RC5PPS1                          BANKMASK(RC5PPS), 1
#define RC5PPS2                          BANKMASK(RC5PPS), 2
#define RC5PPS3                          BANKMASK(RC5PPS), 3
#define RC5PPS4                          BANKMASK(RC5PPS), 4
#define RC5PPS5                          BANKMASK(RC5PPS), 5
#define RC6                              BANKMASK(PORTC), 6
#define RC6PPS0                          BANKMASK(RC6PPS), 0
#define RC6PPS1                          BANKMASK(RC6PPS), 1
#define RC6PPS2                          BANKMASK(RC6PPS), 2
#define RC6PPS3                          BANKMASK(RC6PPS), 3
#define RC6PPS4                          BANKMASK(RC6PPS), 4
#define RC6PPS5                          BANKMASK(RC6PPS), 5
#define RC7                              BANKMASK(PORTC), 7
#define RC7PPS0                          BANKMASK(RC7PPS), 0
#define RC7PPS1                          BANKMASK(RC7PPS), 1
#define RC7PPS2                          BANKMASK(RC7PPS), 2
#define RC7PPS3                          BANKMASK(RC7PPS), 3
#define RC7PPS4                          BANKMASK(RC7PPS), 4
#define RC7PPS5                          BANKMASK(RC7PPS), 5
#define RCEN1                            BANKMASK(SSP1CON2), 3
#define RCEN2                            BANKMASK(SSP2CON2), 3
#define RCIDL                            BANKMASK(BAUD1CON), 6
#define RCIE                             BANKMASK(PIE3), 5
#define RCIF                             BANKMASK(PIR3), 5
#define RD                               BANKMASK(NVMCON1), 0
#define RD0                              BANKMASK(PORTD), 0
#define RD0PPS0                          BANKMASK(RD0PPS), 0
#define RD0PPS1                          BANKMASK(RD0PPS), 1
#define RD0PPS2                          BANKMASK(RD0PPS), 2
#define RD0PPS3                          BANKMASK(RD0PPS), 3
#define RD0PPS4                          BANKMASK(RD0PPS), 4
#define RD0PPS5                          BANKMASK(RD0PPS), 5
#define RD1                              BANKMASK(PORTD), 1
#define RD161                            BANKMASK(T1CON), 1
#define RD163                            BANKMASK(T3CON), 1
#define RD165                            BANKMASK(T5CON), 1
#define RD1PPS0                          BANKMASK(RD1PPS), 0
#define RD1PPS1                          BANKMASK(RD1PPS), 1
#define RD1PPS2                          BANKMASK(RD1PPS), 2
#define RD1PPS3                          BANKMASK(RD1PPS), 3
#define RD1PPS4                          BANKMASK(RD1PPS), 4
#define RD1PPS5                          BANKMASK(RD1PPS), 5
#define RD2                              BANKMASK(PORTD), 2
#define RD2PPS0                          BANKMASK(RD2PPS), 0
#define RD2PPS1                          BANKMASK(RD2PPS), 1
#define RD2PPS2                          BANKMASK(RD2PPS), 2
#define RD2PPS3                          BANKMASK(RD2PPS), 3
#define RD2PPS4                          BANKMASK(RD2PPS), 4
#define RD2PPS5                          BANKMASK(RD2PPS), 5
#define RD3                              BANKMASK(PORTD), 3
#define RD3PPS0                          BANKMASK(RD3PPS), 0
#define RD3PPS1                          BANKMASK(RD3PPS), 1
#define RD3PPS2                          BANKMASK(RD3PPS), 2
#define RD3PPS3                          BANKMASK(RD3PPS), 3
#define RD3PPS4                          BANKMASK(RD3PPS), 4
#define RD3PPS5                          BANKMASK(RD3PPS), 5
#define RD4                              BANKMASK(PORTD), 4
#define RD4PPS0                          BANKMASK(RD4PPS), 0
#define RD4PPS1                          BANKMASK(RD4PPS), 1
#define RD4PPS2                          BANKMASK(RD4PPS), 2
#define RD4PPS3                          BANKMASK(RD4PPS), 3
#define RD4PPS4                          BANKMASK(RD4PPS), 4
#define RD4PPS5                          BANKMASK(RD4PPS), 5
#define RD5                              BANKMASK(PORTD), 5
#define RD5PPS0                          BANKMASK(RD5PPS), 0
#define RD5PPS1                          BANKMASK(RD5PPS), 1
#define RD5PPS2                          BANKMASK(RD5PPS), 2
#define RD5PPS3                          BANKMASK(RD5PPS), 3
#define RD5PPS4                          BANKMASK(RD5PPS), 4
#define RD5PPS5                          BANKMASK(RD5PPS), 5
#define RD6                              BANKMASK(PORTD), 6
#define RD6PPS0                          BANKMASK(RD6PPS), 0
#define RD6PPS1                          BANKMASK(RD6PPS), 1
#define RD6PPS2                          BANKMASK(RD6PPS), 2
#define RD6PPS3                          BANKMASK(RD6PPS), 3
#define RD6PPS4                          BANKMASK(RD6PPS), 4
#define RD6PPS5                          BANKMASK(RD6PPS), 5
#define RD7                              BANKMASK(PORTD), 7
#define RD7PPS0                          BANKMASK(RD7PPS), 0
#define RD7PPS1                          BANKMASK(RD7PPS), 1
#define RD7PPS2                          BANKMASK(RD7PPS), 2
#define RD7PPS3                          BANKMASK(RD7PPS), 3
#define RD7PPS4                          BANKMASK(RD7PPS), 4
#define RD7PPS5                          BANKMASK(RD7PPS), 5
#define RE0                              BANKMASK(PORTE), 0
#define RE0PPS0                          BANKMASK(RE0PPS), 0
#define RE0PPS1                          BANKMASK(RE0PPS), 1
#define RE0PPS2                          BANKMASK(RE0PPS), 2
#define RE0PPS3                          BANKMASK(RE0PPS), 3
#define RE0PPS4                          BANKMASK(RE0PPS), 4
#define RE0PPS5                          BANKMASK(RE0PPS), 5
#define RE1                              BANKMASK(PORTE), 1
#define RE1PPS0                          BANKMASK(RE1PPS), 0
#define RE1PPS1                          BANKMASK(RE1PPS), 1
#define RE1PPS2                          BANKMASK(RE1PPS), 2
#define RE1PPS3                          BANKMASK(RE1PPS), 3
#define RE1PPS4                          BANKMASK(RE1PPS), 4
#define RE1PPS5                          BANKMASK(RE1PPS), 5
#define RE2                              BANKMASK(PORTE), 2
#define RE2PPS0                          BANKMASK(RE2PPS), 0
#define RE2PPS1                          BANKMASK(RE2PPS), 1
#define RE2PPS2                          BANKMASK(RE2PPS), 2
#define RE2PPS3                          BANKMASK(RE2PPS), 3
#define RE2PPS4                          BANKMASK(RE2PPS), 4
#define RE2PPS5                          BANKMASK(RE2PPS), 5
#define RE3                              BANKMASK(PORTE), 3
#define READ_WRITE1                      BANKMASK(SSP1STAT), 2
#define READ_WRITE2                      BANKMASK(SSP2STAT), 2
#define ROI                              BANKMASK(CPUDOZE), 5
#define RSEN1                            BANKMASK(SSP1CON2), 1
#define RSEN2                            BANKMASK(SSP2CON2), 1
#define RW1                              BANKMASK(SSP1STAT), 2
#define RW2                              BANKMASK(SSP2STAT), 2
#define RX9                              BANKMASK(RC1STA), 6
#define RX9D                             BANKMASK(RC1STA), 0
#define RXPPS0                           BANKMASK(RXPPS), 0
#define RXPPS1                           BANKMASK(RXPPS), 1
#define RXPPS2                           BANKMASK(RXPPS), 2
#define RXPPS3                           BANKMASK(RXPPS), 3
#define RXPPS4                           BANKMASK(RXPPS), 4
#define R_W1                             BANKMASK(SSP1STAT), 2
#define R_W2                             BANKMASK(SSP2STAT), 2
#define R_nW1                            BANKMASK(SSP1STAT), 2
#define R_nW2                            BANKMASK(SSP2STAT), 2
#define SBOREN                           BANKMASK(BORCON), 7
#define SCANBUSY                         BANKMASK(SCANCON0), 5
#define SCANEN                           BANKMASK(SCANCON0), 7
#define SCANGO                           BANKMASK(SCANCON0), 6
#define SCANHADR0                        BANKMASK(SCANHADRL), 0
#define SCANHADR1                        BANKMASK(SCANHADRL), 1
#define SCANHADR10                       BANKMASK(SCANHADRH), 2
#define SCANHADR11                       BANKMASK(SCANHADRH), 3
#define SCANHADR12                       BANKMASK(SCANHADRH), 4
#define SCANHADR13                       BANKMASK(SCANHADRH), 5
#define SCANHADR14                       BANKMASK(SCANHADRH), 6
#define SCANHADR15                       BANKMASK(SCANHADRH), 7
#define SCANHADR2                        BANKMASK(SCANHADRL), 2
#define SCANHADR3                        BANKMASK(SCANHADRL), 3
#define SCANHADR4                        BANKMASK(SCANHADRL), 4
#define SCANHADR5                        BANKMASK(SCANHADRL), 5
#define SCANHADR6                        BANKMASK(SCANHADRL), 6
#define SCANHADR7                        BANKMASK(SCANHADRL), 7
#define SCANHADR8                        BANKMASK(SCANHADRH), 0
#define SCANHADR9                        BANKMASK(SCANHADRH), 1
#define SCANIE                           BANKMASK(PIE7), 7
#define SCANIF                           BANKMASK(PIR7), 7
#define SCANINTM                         BANKMASK(SCANCON0), 3
#define SCANINVALID                      BANKMASK(SCANCON0), 4
#define SCANLADR0                        BANKMASK(SCANLADRL), 0
#define SCANLADR1                        BANKMASK(SCANLADRL), 1
#define SCANLADR10                       BANKMASK(SCANLADRH), 2
#define SCANLADR11                       BANKMASK(SCANLADRH), 3
#define SCANLADR12                       BANKMASK(SCANLADRH), 4
#define SCANLADR13                       BANKMASK(SCANLADRH), 5
#define SCANLADR14                       BANKMASK(SCANLADRH), 6
#define SCANLADR15                       BANKMASK(SCANLADRH), 7
#define SCANLADR2                        BANKMASK(SCANLADRL), 2
#define SCANLADR3                        BANKMASK(SCANLADRL), 3
#define SCANLADR4                        BANKMASK(SCANLADRL), 4
#define SCANLADR5                        BANKMASK(SCANLADRL), 5
#define SCANLADR6                        BANKMASK(SCANLADRL), 6
#define SCANLADR7                        BANKMASK(SCANLADRL), 7
#define SCANLADR8                        BANKMASK(SCANLADRH), 0
#define SCANLADR9                        BANKMASK(SCANLADRH), 1
#define SCANMD                           BANKMASK(PMD0), 3
#define SCANMODE0                        BANKMASK(SCANCON0), 0
#define SCANMODE1                        BANKMASK(SCANCON0), 1
#define SCANTSEL0                        BANKMASK(SCANTRIG), 0
#define SCANTSEL1                        BANKMASK(SCANTRIG), 1
#define SCANTSEL2                        BANKMASK(SCANTRIG), 2
#define SCANTSEL3                        BANKMASK(SCANTRIG), 3
#define SCKP                             BANKMASK(BAUD1CON), 4
#define SEN1                             BANKMASK(SSP1CON2), 0
#define SEN2                             BANKMASK(SSP2CON2), 0
#define SENDB                            BANKMASK(TX1STA), 3
#define SHFT0                            BANKMASK(CRCSHIFTL), 0
#define SHFT1                            BANKMASK(CRCSHIFTL), 1
#define SHFT10                           BANKMASK(CRCSHIFTH), 2
#define SHFT11                           BANKMASK(CRCSHIFTH), 3
#define SHFT12                           BANKMASK(CRCSHIFTH), 4
#define SHFT13                           BANKMASK(CRCSHIFTH), 5
#define SHFT14                           BANKMASK(CRCSHIFTH), 6
#define SHFT15                           BANKMASK(CRCSHIFTH), 7
#define SHFT2                            BANKMASK(CRCSHIFTL), 2
#define SHFT3                            BANKMASK(CRCSHIFTL), 3
#define SHFT4                            BANKMASK(CRCSHIFTL), 4
#define SHFT5                            BANKMASK(CRCSHIFTL), 5
#define SHFT6                            BANKMASK(CRCSHIFTL), 6
#define SHFT7                            BANKMASK(CRCSHIFTL), 7
#define SHFT8                            BANKMASK(CRCSHIFTH), 0
#define SHFT9                            BANKMASK(CRCSHIFTH), 1
#define SHIFTM                           BANKMASK(CRCCON0), 1
#define SLRA0                            BANKMASK(SLRCONA), 0
